feaser/openblt/stm32g4_port/Target/Source/ARMCM4_STM32G4/flash.c
/************************************************************************************//**
* \file         Source/ARMCM4_STM32G4/flash.c
* \brief        Bootloader flash driver source file.
* \ingroup      Target_ARMCM4_STM32G4
* \internal
*----------------------------------------------------------------------------------------
*                          C O P Y R I G H T
*----------------------------------------------------------------------------------------
*   Copyright (c) 2021  by Feaser    http://www.feaser.com    All rights reserved
*
*----------------------------------------------------------------------------------------
*                            L I C E N S E
*----------------------------------------------------------------------------------------
* This file is part of OpenBLT. OpenBLT is free software: you can redistribute it and/or
* modify it under the terms of the GNU General Public License as published by the Free
* Software Foundation, either version 3 of the License, or (at your option) any later
* version.
*
* OpenBLT is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
* without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR
* PURPOSE. See the GNU General Public License for more details.
*
* You have received a copy of the GNU General Public License along with OpenBLT. It
* should be located in ".\Doc\license.html". If not, contact Feaser to obtain a copy.
*
* \endinternal
****************************************************************************************/

/****************************************************************************************
* Include files
****************************************************************************************/
#include "boot.h"                                /* bootloader generic header          */
#include "stm32g4xx.h"                           /* STM32 CPU and HAL header           */



/****************************************************************************************
* Macro definitions
****************************************************************************************/
/** \brief Value for an invalid sector entry index into flashLayout[]. */
#define FLASH_INVALID_SECTOR_IDX        (0xff)
/** \brief Value for an invalid flash address. */
#define FLASH_INVALID_ADDRESS           (0xffffffff)
/** \brief Standard size of a flash block for writing. */
#define FLASH_WRITE_BLOCK_SIZE          (512)
/** \brief Standard size of a flash page for erasing. note that a flash sector can
 *         have multiple pages.
 */
#define FLASH_ERASE_PAGE_SIZE           (FLASH_PAGE_SIZE)
/** \brief Total numbers of sectors in array flashLayout[]. */
#define FLASH_TOTAL_SECTORS             (sizeof(flashLayout)/sizeof(flashLayout[0]))
/** \brief End address of the bootloader programmable flash. */
#define FLASH_END_ADDRESS               (flashLayout[FLASH_TOTAL_SECTORS-1].sector_start + \
                                         flashLayout[FLASH_TOTAL_SECTORS-1].sector_size - 1)
/** \brief Offset into the user program's vector table where the checksum is located. 
 *         For this target it is set to the end of the vector table. Note that the 
 *         value can be overriden in blt_conf.h, because the size of the vector table
 *         could vary. When changing this value, don't forget to update the location
 *         of the checksum in the user program accordingly. Otherwise the checksum
 *         verification will always fail.
 */
#ifndef BOOT_FLASH_VECTOR_TABLE_CS_OFFSET
#define BOOT_FLASH_VECTOR_TABLE_CS_OFFSET    (0x1D8)
#endif


/****************************************************************************************
* Plausibility checks
****************************************************************************************/
#if (BOOT_FLASH_VECTOR_TABLE_CS_OFFSET >= FLASH_WRITE_BLOCK_SIZE)
#error "BOOT_FLASH_VECTOR_TABLE_CS_OFFSET is set too high. It must be located in the first writable block."
#endif

#ifndef BOOT_FLASH_CUSTOM_LAYOUT_ENABLE
#define BOOT_FLASH_CUSTOM_LAYOUT_ENABLE (0u)
#endif


/****************************************************************************************
* Type definitions
****************************************************************************************/
/* TODO ##Port sector_num might not be needed. If so, remove it. */
/** \brief Flash sector descriptor type. */
typedef struct
{
  blt_addr   sector_start;                       /**< sector start address             */
  blt_int32u sector_size;                        /**< sector size in bytes             */
  blt_int8u  sector_num;                         /**< sector number                    */
} tFlashSector;

/** \brief    Structure type for grouping flash block information.
 *  \details  Programming is done per block of max FLASH_WRITE_BLOCK_SIZE. for this a
 *            flash block manager is implemented in this driver. this flash block manager
 *            depends on this flash block info structure. It holds the base address of
 *            the flash block and the data that should be programmed into the flash
 *            block. The .base_addr must be a multiple of FLASH_WRITE_BLOCK_SIZE.
 */
typedef struct
{
  blt_addr  base_addr;
  blt_int8u data[FLASH_WRITE_BLOCK_SIZE];
} tFlashBlockInfo;


/****************************************************************************************
* Hook functions
****************************************************************************************/
#if (BOOT_FLASH_CRYPTO_HOOKS_ENABLE > 0)
extern blt_bool FlashCryptoDecryptDataHook(blt_int8u * data, blt_int32u size);
#endif


/****************************************************************************************
* Function prototypes
****************************************************************************************/
static blt_bool   FlashInitBlock(tFlashBlockInfo *block, blt_addr address);
static tFlashBlockInfo *FlashSwitchBlock(tFlashBlockInfo *block, blt_addr base_addr);
static blt_bool   FlashAddToBlock(tFlashBlockInfo *block, blt_addr address,
                                  blt_int8u *data, blt_int32u len);
static blt_bool   FlashWriteBlock(tFlashBlockInfo *block);
static blt_bool   FlashEraseSectors(blt_int8u first_sector_idx,
                                    blt_int8u last_sector_idx);
static blt_int8u  FlashGetSectorIdx(blt_addr address);
static blt_int32u FlashGetPage(blt_addr address);
static blt_int32u FlashGetBank(blt_addr address);
static blt_bool   FlashVerifyBankMode(void);


/****************************************************************************************
* Local constant declarations
****************************************************************************************/
/** \brief   If desired, it is possible to set BOOT_FLASH_CUSTOM_LAYOUT_ENABLE to > 0
 *           in blt_conf.h and then implement your own version of the flashLayout[] table
 *           in a source-file with the name flash_layout.c. This way you customize the
 *           flash memory size reserved for the bootloader, without having to modify
 *           the flashLayout[] table in this file directly. This file will then include
 *           flash_layout.c so there is no need to compile it additionally with your
 *           project.
 */
#if (BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0)
/** \brief     Array wit the layout of the flash memory.
 *  \details   Also controls what part of the flash memory is reserved for the
 *             bootloader. If the bootloader size changes, the reserved sectors for the
 *             bootloader might need adjustment to make sure the bootloader doesn't get
 *             overwritten.
 *  \attention For category 3 flash device, which have dual banking mode support, this
 *             flash driver only supports dual banking mode configuration, not single
 *             banking mode. Simply because that is the default configuration that ST
 *             programs in the option bytes. This means that flash pages are always 2kb
 *             in size. Some sectors span multiple pages in this table. The only reason
 *             for this is to not make the table unnecessarily long, which would just
 *             waste flash space.
 */
static const tFlashSector flashLayout[] =
{
  /* { 0x08000000, 0x00800,  0},           flash sector  0 - reserved for bootloader   */
  /* { 0x08000800, 0x00800,  1},           flash sector  1 - reserved for bootloader   */
  /* { 0x08001000, 0x00800,  2},           flash sector  2 - reserved for bootloader   */
  /* { 0x08001800, 0x00800,  3},           flash sector  3 - reserved for bootloader   */
  /* { 0x08002000, 0x00800,  4},           flash sector  4 - reserved for bootloader   */
  /* { 0x08002800, 0x00800,  5},           flash sector  5 - reserved for bootloader   */
  { 0x08003000, 0x00800,  6},           /* flash sector  6 - 2kb                       */
  { 0x08003800, 0x00800,  7},           /* flash sector  7 - 2kb                       */
  { 0x08004000, 0x00800,  8},           /* flash sector  8 - 2kb                       */
  { 0x08004800, 0x00800,  9},           /* flash sector  9 - 2kb                       */
  { 0x08005000, 0x00800, 10},           /* flash sector 10 - 2kb                       */
  { 0x08005800, 0x00800, 11},           /* flash sector 11 - 2kb                       */
  { 0x08006000, 0x00800, 12},           /* flash sector 12 - 2kb                       */
  { 0x08006800, 0x00800, 13},           /* flash sector 13 - 2kb                       */
  { 0x08007000, 0x00800, 14},           /* flash sector 14 - 2kb                       */
  { 0x08007800, 0x00800, 15},           /* flash sector 15 - 2kb                       */
#if (BOOT_NVM_SIZE_KB > 32)
  { 0x08008000, 0x04000, 16},           /* flash sector 16 - 16kb                      */
  { 0x0800C000, 0x04000, 17},           /* flash sector 17 - 16kb                      */
#endif
#if (BOOT_NVM_SIZE_KB > 64)
  { 0x08010000, 0x4000,  18},            /* flash sector 18 - 16kb                      */
  { 0x08014000, 0x4000,  19},            /* flash sector 19 - 16kb                      */
  { 0x08018000, 0x4000,  20},            /* flash sector 20 - 16kb                      */
  { 0x0801C000, 0x4000,  21},            /* flash sector 21 - 16kb                      */
#endif
#if (BOOT_NVM_SIZE_KB > 128)
  { 0x08020000, 0x4000, 22},            /* flash sector 22 - 16kb                      */
  { 0x08024000, 0x4000, 23},            /* flash sector 23 - 16kb                      */
  { 0x08028000, 0x4000, 24},            /* flash sector 24 - 16kb                      */
  { 0x0802C000, 0x4000, 25},            /* flash sector 25 - 16kb                      */
  { 0x08030000, 0x4000, 26},            /* flash sector 26 - 16kb                      */
  { 0x08034000, 0x4000, 27},            /* flash sector 27 - 16kb                      */
  { 0x08038000, 0x4000, 28},            /* flash sector 28 - 16kb                      */
  { 0x0803C000, 0x4000, 29},            /* flash sector 29 - 16kb                      */
#endif
#if (BOOT_NVM_SIZE_KB > 256)
  { 0x08040000, 0x4000, 30},            /* flash sector 30 - 16kb                      */
  { 0x08044000, 0x4000, 31},            /* flash sector 31 - 16kb                      */
  { 0x08048000, 0x4000, 32},            /* flash sector 32 - 16kb                      */
  { 0x0804C000, 0x4000, 33},            /* flash sector 33 - 16kb                      */
  { 0x08050000, 0x4000, 34},            /* flash sector 34 - 16kb                      */
  { 0x08054000, 0x4000, 35},            /* flash sector 35 - 16kb                      */
  { 0x08058000, 0x4000, 36},            /* flash sector 36 - 16kb                      */
  { 0x0805C000, 0x4000, 37},            /* flash sector 37 - 16kb                      */
  { 0x08060000, 0x4000, 38},            /* flash sector 38 - 16kb                      */
  { 0x08064000, 0x4000, 39},            /* flash sector 39 - 16kb                      */
  { 0x08068000, 0x4000, 40},            /* flash sector 40 - 16kb                      */
  { 0x0806C000, 0x4000, 41},            /* flash sector 41 - 16kb                      */
  { 0x08070000, 0x4000, 42},            /* flash sector 42 - 16kb                      */
  { 0x08074000, 0x4000, 43},            /* flash sector 43 - 16kb                      */
  { 0x08078000, 0x4000, 44},            /* flash sector 44 - 16kb                      */
  { 0x0807C000, 0x4000, 45},            /* flash sector 45 - 16kb                      */
#endif
#if (BOOT_NVM_SIZE_KB > 512)
#error "BOOT_NVM_SIZE_KB > 512 is currently not supported."
#endif
};
#else
#include "flash_layout.c"
#endif /* BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0 */


/****************************************************************************************
* Local data declarations
****************************************************************************************/
/** \brief   Local variable with information about the flash block that is currently
 *           being operated on.
 *  \details The smallest amount of flash that can be programmed is
 *           FLASH_WRITE_BLOCK_SIZE. A flash block manager is implemented in this driver
 *           and stores info in this variable. Whenever new data should be flashed, it
 *           is first added to a RAM buffer, which is part of this variable. Whenever
 *           the RAM buffer, which has the size of a flash block, is full or  data needs
 *           to be written to a different block, the contents of the RAM buffer are
 *           programmed to flash. The flash block manager requires some software
 *           overhead, yet results is faster flash programming because data is first
 *           harvested, ideally until there is enough to program an entire flash block,
 *           before the flash device is actually operated on.
 */
static tFlashBlockInfo blockInfo;

