feaser/openblt/stm32g4_port/Target/Source/ARMCM4_STM32G4/flash.c
  /* search through the sectors to find the right one */
  for (sectorIdx = 0; sectorIdx < FLASH_TOTAL_SECTORS; sectorIdx++)
  {
    /* keep the watchdog happy */
    CopService();
    /* is the address in this sector? */
    if ((address >= flashLayout[sectorIdx].sector_start) && \
        (address < (flashLayout[sectorIdx].sector_start + \
                    flashLayout[sectorIdx].sector_size)))
    {
      /* update the result value and stop looping */
      result = sectorIdx;
      break;
    }
  }

  /* give the result back to the caller */
  return result;
} /*** end of FlashGetSectorIdx ***/


/************************************************************************************//**
** \brief     Determines the flash page number that the specified address belongs to.
** \param     address Flash memory address.
** \return    The flash page number that this address belongs to.
**
****************************************************************************************/
static blt_int32u FlashGetPage(blt_addr address)
{
  blt_int32u result;

  /* does the page belong to the first bank? */
  if (FlashGetBank(address) == FLASH_BANK_1)
  {
    /* sanity check. */
    ASSERT_RT(address >= FLASH_BASE);
    /* calculate the page number. */
    result = (address - FLASH_BASE) / FLASH_ERASE_PAGE_SIZE;
  }
  /* the page belongs to the second bank. */
  else
  {
    /* sanity check. */
    ASSERT_RT(address >= (FLASH_BASE + FLASH_BANK_SIZE));
    /* calculate the page number. */
    result = (address - (FLASH_BASE + FLASH_BANK_SIZE)) / FLASH_ERASE_PAGE_SIZE;
  }

  /* give the result back to the caller */
  return result;
} /*** end of FlashGetPage ***/


/************************************************************************************//**
** \brief     Determines the flash bank number that the specified address belongs to.
** \param     address Flash memory address.
** \return    The flash bank number that this address belongs to. It can be either
**            FLASH_BANK_1 or FLASH_BANK_2.
**
****************************************************************************************/
static blt_int32u FlashGetBank(blt_addr address)
{
  blt_int32u result = FLASH_BANK_1;

  /* address can only be in bank 2 if the flash device supports dual banking. */
#if defined (FLASH_OPTR_DBANK)
  /* is this an address in the second bank? */
  if (address >= (FLASH_BASE + FLASH_BANK_SIZE))
  {
    /* update the result. */
    result = FLASH_BANK_2;
  }
#endif

  /* give the result back to the caller. */
  return result;
} /*** end of FlashGetBank ***/


/************************************************************************************//**
** \brief     Determines the flash banking mode is configured properly for this flash
**            driver. This flash driver assumes that dual banking mode is configured,
**            if the flash device supports dual banking mode. This is default mode as
**            configured by ST in the option bytes.
** \return    BLT_TRUE if the flash banking mode is configured properly as supported by
**            this flash driver, BLT_FALSE otherwise.
**
****************************************************************************************/
static blt_bool FlashVerifyBankMode(void)
{
  blt_bool result = BLT_TRUE;

  /* only need to verify banking mode, if the flash device actually supports different
   * banking modes.
   */
#if defined (FLASH_OPTR_DBANK)
  /* is the flash device configured for single bank mode? */
  if ((FLASH->OPTR & FLASH_OPTR_DBANK) == 0U)
  {
    /* single bank mode is not supported. update the result accordingly. */
    result = BLT_FALSE;
  }
#endif

  /* give the result back to the caller. */
  return result;
} /*** end of FlashVerifyBankMode ***/


/*********************************** end of flash.c ************************************/
